<?php

$json = <<<EOF
{
  "colors": [
    {
      "id": 1,
      "code": "01",
      "name": "ホワイト",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 2,
      "code": "02",
      "name": "オフホワイト",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 3,
      "code": "03",
      "name": "アイボリー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 4,
      "code": "05",
      "name": "ブロンズ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 5,
      "code": "06",
      "name": "シルバー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 6,
      "code": "07",
      "name": "ゴールド",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 7,
      "code": "08",
      "name": "シルバーゴールド",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 8,
      "code": "09",
      "name": "ガンメタ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 9,
      "code": "11",
      "name": "グレー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 10,
      "code": "12",
      "name": "グレー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 11,
      "code": "13",
      "name": "グレージュ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 12,
      "code": "14",
      "name": "グレー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 13,
      "code": "15",
      "name": "グレージュ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 14,
      "code": "16",
      "name": "グレー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 15,
      "code": "17",
      "name": "グレー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 16,
      "code": "18",
      "name": "チャコール",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 17,
      "code": "21",
      "name": "ブラックホワイト",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 18,
      "code": "22",
      "name": "ブラックオフホワイト",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 19,
      "code": "23",
      "name": "ブラックシルバー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 20,
      "code": "24",
      "name": "ブラックゴールド",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 21,
      "code": "25",
      "name": "クリア",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 22,
      "code": "26",
      "name": "マルチ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 23,
      "code": "29",
      "name": "ブラック",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 24,
      "code": "31",
      "name": "ベージュ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 25,
      "code": "32",
      "name": "ベージュ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 26,
      "code": "33",
      "name": "ベージュ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 27,
      "code": "34",
      "name": "キャメル",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 28,
      "code": "35",
      "name": "ブラウン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 29,
      "code": "36",
      "name": "ブラウン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 30,
      "code": "37",
      "name": "ブラウン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 31,
      "code": "38",
      "name": "ブラウン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 32,
      "code": "39",
      "name": "ブラウン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 33,
      "code": "41",
      "name": "ピンク",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 34,
      "code": "42",
      "name": "ピンク",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 35,
      "code": "43",
      "name": "ピンク",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 36,
      "code": "44",
      "name": "ピンク",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 37,
      "code": "45",
      "name": "ピンク",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 38,
      "code": "46",
      "name": "ピンク",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 39,
      "code": "47",
      "name": "レッド",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 40,
      "code": "48",
      "name": "ワインレッド",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 41,
      "code": "49",
      "name": "エンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 42,
      "code": "51",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 43,
      "code": "52",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 44,
      "code": "53",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 45,
      "code": "54",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 46,
      "code": "55",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 47,
      "code": "56",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 48,
      "code": "57",
      "name": "オレンジ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 49,
      "code": "58",
      "name": "テラコッタ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 50,
      "code": "59",
      "name": "テラコッタ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 51,
      "code": "61",
      "name": "クリーム",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 52,
      "code": "62",
      "name": "クリーム",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 53,
      "code": "63",
      "name": "クリーム",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 54,
      "code": "64",
      "name": "カーキ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 55,
      "code": "65",
      "name": "カーキ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 56,
      "code": "66",
      "name": "イエロー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 57,
      "code": "67",
      "name": "イエロー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 58,
      "code": "68",
      "name": "マスタード",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 59,
      "code": "69",
      "name": "マスタード",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 60,
      "code": "71",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 61,
      "code": "72",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 62,
      "code": "73",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 63,
      "code": "74",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 64,
      "code": "75",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 65,
      "code": "76",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 66,
      "code": "77",
      "name": "グリーン",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 67,
      "code": "78",
      "name": "オリーブ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 68,
      "code": "79",
      "name": "オリーブ",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 69,
      "code": "81",
      "name": "ブルー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 70,
      "code": "82",
      "name": "ブルー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 71,
      "code": "83",
      "name": "ブルー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 72,
      "code": "84",
      "name": "ブルー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 73,
      "code": "85",
      "name": "ブルー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 74,
      "code": "86",
      "name": "ブルー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 75,
      "code": "88",
      "name": "ネイビー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 76,
      "code": "89",
      "name": "ネイビー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 77,
      "code": "91",
      "name": "ラベンダー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 78,
      "code": "92",
      "name": "ラベンダー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 79,
      "code": "93",
      "name": "ラベンダー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 80,
      "code": "94",
      "name": "ラベンダー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 81,
      "code": "95",
      "name": "ラベンダー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 82,
      "code": "96",
      "name": "パープル",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 83,
      "code": "97",
      "name": "パープル",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 84,
      "code": "98",
      "name": "パープル",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 85,
      "code": "99",
      "name": "パープル",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    },
    {
      "id": 86,
      "code": "14",
      "name": "ライトグレー",
      "created_at": "2021-01-13 15:16:33",
      "updated_at": "2021-01-13 15:16:33"
    }
  ]
}
EOF;

return json_decode($json, true);
